In [1]:
from pyspark.sql import SparkSession

spark = SparkSession.builder \
    .appName("TestApp") \
    .master("spark://spark-master:7077") \
    .getOrCreate()

df = spark.range(5).toDF("numbers")
df.show()

+-------+
|numbers|
+-------+
|      0|
|      1|
|      2|
|      3|
|      4|
+-------+

In [2]:
import pandas as pd
import numpy as np

pd.DataFrame({
    "id": range(1, 6),
    "value": np.random.randint(10, 100, 5)
})

   id  value
0   1     29
1   2     12
2   3     91
3   4     78
4   5     83

In [3]:
import sqlalchemy as sa
import pandas as pd

engine = sa.create_engine("postgresql+psycopg2://admin:admin@postgres:5432/metadata")

with engine.begin() as conn:
    conn.execute(sa.text("CREATE TABLE IF NOT EXISTS test_table (id SERIAL PRIMARY KEY, name TEXT);"))
    conn.execute(sa.text("INSERT INTO test_table (name) VALUES ('Ashutosh'), ('Data'), ('Engineer');"))

pd.read_sql("SELECT * FROM test_table", engine)

   id      name
0   1  Ashutosh
1   2      Data
2   3  Engineer
3   4  Ashutosh
4   5      Data
5   6  Engineer

In [4]:
from pymongo import MongoClient

client = MongoClient("mongodb://admin:admin@mongo:27017/")
db = client["test_db"]
col = db["test_collection"]

col.insert_many([{"name": "Spark"}, {"name": "Kafka"}, {"name": "Airflow"}])

list(col.find())

[{'_id': ObjectId('68a22fe74579e86d33b4a3f3'), 'name': 'Spark'},
 {'_id': ObjectId('68a22fe74579e86d33b4a3f4'), 'name': 'Kafka'},
 {'_id': ObjectId('68a22fe74579e86d33b4a3f5'), 'name': 'Airflow'},
 {'_id': ObjectId('68a240101a4c302dc05a33ae'), 'name': 'Spark'},
 {'_id': ObjectId('68a240101a4c302dc05a33af'), 'name': 'Kafka'},
 {'_id': ObjectId('68a240101a4c302dc05a33b0'), 'name': 'Airflow'}]

In [5]:
from kafka import KafkaProducer, KafkaConsumer

# Producer
producer = KafkaProducer(bootstrap_servers="kafka:9092")
producer.send("test-topic", b"Hello from Jupyter!")
producer.flush()

# Consumer
consumer = KafkaConsumer(
    "test-topic",
    bootstrap_servers="kafka:9092",
    auto_offset_reset="earliest",
    enable_auto_commit=True,
    group_id="test-group"
)

for msg in consumer:
    print("Received:", msg.value.decode())
    break

Received: Hello from Jupyter!